Ran Plan for dir: `terraform/iam/seeun-id` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.5.7 plan -input=false -refresh -no-color -out \"/home/atlantis/.atlantis/repos/ssen-hailey/test-provisioning/11/default/terraform/iam/seeun-id/iam::seeun_id-default.tfplan\" -var 'assume_role_arn=arn:aws:iam::680463082671:role/atlantis-seeun-id-admin'" in "/home/atlantis/.atlantis/repos/ssen-hailey/test-provisioning/11/default/terraform/iam/seeun-id": exit status 1
module.terraform_runner.data.aws_iam_policy_document.policy_document: Reading...
data.aws_iam_policy_document.jenkins_ecr_document: Reading...
data.aws_iam_policy_document.codebuild_deployment_ecr_document: Reading...
aws_iam_user.seeun: Refreshing state... [id=seeun]
aws_iam_group.devops_black: Refreshing state... [id=devops_black]
data.aws_iam_policy_document.jenkins_cloudwatch_document: Reading...
module.terraform_runner.data.aws_iam_policy_document.terraform_runner_passrole: Reading...
module.terraform_runner.data.aws_iam_policy_document.terraform_runner_s3: Reading...
module.terraform_runner.data.aws_iam_policy_document.terraform_runner_dynamodb: Reading...
module.sops_seeun_id.aws_iam_role.secure: Refreshing state... [id=seeun-id-secure-sops]
module.terraform_runner.data.aws_iam_policy_document.terraform_runner_dynamodb: Read complete after 0s [id=2609933005]
data.aws_iam_policy_document.codebuild_deployment_ecr_document: Read complete after 0s [id=482158191]
module.terraform_runner.data.aws_iam_policy_document.terraform_runner_s3: Read complete after 0s [id=3607919700]
module.terraform_runner.data.aws_iam_policy_document.terraform_runner_passrole: Read complete after 0s [id=755360459]
data.aws_iam_policy_document.jenkins_ecr_document: Read complete after 0s [id=3720231688]
module.terraform_runner.data.aws_iam_policy_document.policy_document: Read complete after 0s [id=447022156]
data.aws_iam_policy_document.jenkins_cloudwatch_document: Read complete after 0s [id=60798268]
data.aws_iam_policy_document.jenkins_universal_document: Reading...
data.aws_iam_policy_document.codebuild_starter_assume_role_document: Reading...
data.aws_iam_policy_document.codebuild_deployment_operation_document: Reading...
data.aws_iam_policy_document.jenkins_universal_document: Read complete after 0s [id=336344261]
data.aws_iam_policy_document.jenkins_operation_document: Reading...
data.aws_iam_policy_document.codebuild_starter_assume_role_document: Read complete after 0s [id=1229436035]
module.sops_seeun_id.aws_iam_role.common: Refreshing state... [id=seeun-id-sops]
data.aws_iam_policy_document.codebuild_deployment_operation_document: Read complete after 0s [id=2404877674]
data.aws_iam_policy_document.jenkins_assume_role_document: Reading...
data.aws_iam_policy_document.codebuild_deployment_cloudwatch_document: Reading...
data.aws_iam_policy_document.jenkins_operation_document: Read complete after 0s [id=3914925036]
data.aws_iam_policy_document.codebuild_deployment_assume_role_document: Reading...
module.terraform_runner.aws_iam_role.terraform_runner: Refreshing state... [id=terraform-runner]
data.aws_iam_policy_document.codebuild_deployment_assume_role_document: Read complete after 0s [id=1229436035]
data.aws_iam_policy_document.jenkins_assume_role_document: Read complete after 0s [id=3361810881]
data.aws_iam_policy_document.codebuild_deployment_cloudwatch_document: Read complete after 0s [id=2170143498]
aws_iam_group_policy_attachment.devops_black: Refreshing state... [id=devops_black-20250907151341157400000001]
aws_iam_group_membership.devops_black: Refreshing state... [id=devops_black]
module.sops_seeun_id.aws_iam_role_policy.secure-passrole: Refreshing state... [id=seeun-id-secure-sops:seeun-id-secure-sops-passrole]
module.sops_seeun_id.aws_iam_role_policy.common-passrole: Refreshing state... [id=seeun-id-sops:seeun-id-sops-passrole]
module.terraform_runner.aws_iam_role_policy.terraform_runner_passrole: Refreshing state... [id=terraform-runner:terraform-runner-passrole]
module.terraform_runner.aws_iam_role_policy_attachment.terraform_runner_readonly: Refreshing state... [id=terraform-runner-20250907151341332600000002]
module.terraform_runner.aws_iam_role_policy.terraform_runner_s3: Refreshing state... [id=terraform-runner:terraform-runner-s3]
module.terraform_runner.aws_iam_role_policy.terraform_runner_dynamodb: Refreshing state... [id=terraform-runner:terraform-runner-dynamodb-access]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # aws_iam_instance_profile.codebuild_deployment will be created
  + resource "aws_iam_instance_profile" "codebuild_deployment" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "codebuild-deployment-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "codebuild-deployment"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_instance_profile.jenkins will be created
  + resource "aws_iam_instance_profile" "jenkins" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "jenkins-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "app-jenkins"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_policy.app_universal will be created
  + resource "aws_iam_policy" "app_universal" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "app-universal"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeSpotInstanceRequests",
                          + "ec2:DescribeTags",
                          + "ec2:CreateTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowAnsibleCreateDescribeEc2TagsAccess"
                    },
                  + {
                      + Action   = [
                          + "ssm:UpdateInstanceInformation",
                          + "ssmmessages:CreateControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:OpenDataChannel",
                          + "ssm:ListAssociations",
                          + "ssm:ListInstanceAssociations",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3:GetEncryptionConfiguration",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2messages:AcknowledgeMessage",
                          + "ec2messages:DeleteMessage",
                          + "ec2messages:FailMessage",
                          + "ec2messages:GetEndpoint",
                          + "ec2messages:GetMessages",
                          + "ec2messages:SendReply",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                          + "secretsmanager:ListSecretVersionIds",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.codebuild_deployment will be created
  + resource "aws_iam_role" "codebuild_deployment" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codebuild.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codebuild-deployment"
      + name_prefix           = (known after apply)
      + path                  = "/service-role/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.codebuild_starter will be created
  + resource "aws_iam_role" "codebuild_starter" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codebuild.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::680463082671:role/app-jenkins",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codebuild-starter"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.jenkins will be created
  + resource "aws_iam_role" "jenkins" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "s3.amazonaws.com",
                              + "ec2.amazonaws.com",
                              + "codebuild.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "app-jenkins"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.codebuild_deployment_cloudwatch will be created
  + resource "aws_iam_role_policy" "codebuild_deployment_cloudwatch" {
      + id          = (known after apply)
      + name        = "codebuild-deployment-cloudwatch"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:680463082671:log-group:/aws/codebuild/*:*",
                          + "arn:aws:logs:*:680463082671:log-group:/aws/codebuild/*",
                          + "arn:aws:logs:*:680463082671:log-group:/*:*:*",
                          + "arn:aws:logs:*:680463082671:log-group:/*:*",
                          + "arn:aws:logs:*:680463082671:log-group:/*",
                          + "arn:aws:logs:*:680463082671:log-group:*:*:*/*",
                        ]
                      + Sid      = "AllowCloudWatchAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.codebuild_deployment_ecr will be created
  + resource "aws_iam_role_policy" "codebuild_deployment_ecr" {
      + id          = (known after apply)
      + name        = "codebuild-deployment-ecr"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowReadECRAccess"
                    },
                  + {
                      + Action   = [
                          + "sts:GetServiceBearerToken",
                          + "ecr:GetAuthorizationToken",
                          + "ecr-public:GetAuthorizationToken",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowGetAuthTokenAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.codebuild_deployment_operation will be created
  + resource "aws_iam_role_policy" "codebuild_deployment_operation" {
      + id          = (known after apply)
      + name        = "codebuild-deployment-operation-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:SendCommand",
                          + "ssm:ListCommandInvocations",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "SSMSendCommand"
                    },
                  + {
                      + Action   = [
                          + "cloudwatch:PutMetricAlarm",
                          + "cloudwatch:Get*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "CloudwatchAccess"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTags",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeInstanceHealth",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentELBAccess"
                    },
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentIAMAccess"
                    },
                  + {
                      + Action   = "ec2:CreateNetworkInterfacePermission"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ec2:ap-northeast-2:680463082671:network-interface/*"
                    },
                  + {
                      + Action   = [
                          + "ec2:ModifyLaunchTemplate",
                          + "ec2:GetLaunchTemplateData",
                          + "ec2:DescribeLaunchTemplates",
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "ec2:DeleteLaunchTemplateVersions",
                          + "ec2:DeleteLaunchTemplate",
                          + "ec2:CreateLaunchTemplateVersion",
                          + "ec2:CreateLaunchTemplate",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "LaunchTemplates"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeDhcpOptions",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentVPCAccess"
                    },
                  + {
                      + Action   = "autoscaling:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentASGAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:DetachVolume",
                          + "ec2:DescribeVolume*",
                          + "ec2:DeleteVolume",
                          + "ec2:CreateVolume",
                          + "ec2:AttachVolume",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentVolumeAccess"
                    },
                  + {
                      + Action   = "ec2:DescribeKeyPairs"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentKeyPairAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:TerminateInstances",
                          + "ec2:StopInstances",
                          + "ec2:StartInstances",
                          + "ec2:RunInstances",
                          + "ec2:RebootInstances",
                          + "ec2:ModifyInstanceAttribute",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeInstances",
                          + "ec2:CreateTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentInstanceAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeSnapshots",
                          + "ec2:CreateSnapshot",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentSnapshotAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:RegisterImage",
                          + "ec2:DescribeImages",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentAMIAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:CreateSecurityGroup",
                          + "ec2:AuthorizeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentSecurityGroupAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.codebuild_starter will be created
  + resource "aws_iam_role_policy" "codebuild_starter" {
      + id          = (known after apply)
      + name        = "codebuild-starter"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:GetLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:*:log-group:/aws/codebuild/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "codebuild:StartBuild",
                          + "codebuild:BatchGetBuilds",
                          + "codebuild:BatchGetProjects",
                          + "codebuild:StopBuild",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:codebuild:*:*:*",
                        ]
                    },
                ]
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.jenkins_cloudwatch will be created
  + resource "aws_iam_role_policy" "jenkins_cloudwatch" {
      + id          = (known after apply)
      + name        = "jenkins-cloudwatch"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:GetLogEvents",
                          + "logs:FilterLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowCloudWatchAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.jenkins_ecr will be created
  + resource "aws_iam_role_policy" "jenkins_ecr" {
      + id          = (known after apply)
      + name        = "jenkins-ecr"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecr:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowGetAuthTokenAccess"
                    },
                  + {
                      + Action   = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:ListImages",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowReadECRAccess"
                    },
                  + {
                      + Action   = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:ListImages",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ap-northeast-2:680463082671:repository/*"
                      + Sid      = "AllowReadAnotherAccountECRAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.jenkins_operation will be created
  + resource "aws_iam_role_policy" "jenkins_operation" {
      + id          = (known after apply)
      + name        = "jenkins-operation-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTags",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeInstanceHealth",
                          + "ec2:TerminateInstances",
                          + "ec2:StopInstances",
                          + "ec2:RunInstances",
                          + "ec2:RequestSpotInstances",
                          + "ec2:RegisterImage",
                          + "ec2:ModifySnapshotAttribute",
                          + "ec2:ModifyInstanceAttribute",
                          + "ec2:ModifyImageAttribute",
                          + "ec2:GetPasswordData",
                          + "ec2:DetachVolume",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeVpcEndpoints",
                          + "ec2:DescribeVpcEndpointServices",
                          + "ec2:DescribeVpcEndpointServicePermissions",
                          + "ec2:DescribeVpcEndpointServiceConfigurations",
                          + "ec2:DescribeVpcEndpointConnections",
                          + "ec2:DescribeVpcEndpointConnectionNotifications",
                          + "ec2:DescribeVpcClassicLinkDnsSupport",
                          + "ec2:DescribeVpcClassicLink",
                          + "ec2:DescribeVolumes",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSpotPriceHistory",
                          + "ec2:DescribeSpotInstanceRequests",
                          + "ec2:DescribeSnapshots",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeRegions",
                          + "ec2:DescribePlacementGroups",
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "ec2:DescribeKeyPairs",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeInstanceAttribute",
                          + "ec2:DescribeImages",
                          + "ec2:DescribeImageAttribute",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DeregisterImage",
                          + "ec2:DeleteVolume",
                          + "ec2:DeleteSnapshot",
                          + "ec2:DeleteSecurityGroup",
                          + "ec2:DeleteKeyPair",
                          + "ec2:CreateVolume",
                          + "ec2:CreateTags",
                          + "ec2:CreateSnapshot",
                          + "ec2:CreateSecurityGroup",
                          + "ec2:CreateKeypair",
                          + "ec2:CreateImage",
                          + "ec2:CopyImage",
                          + "ec2:CancelSpotInstanceRequests",
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:AttachVolume",
                          + "codebuild:*",
                          + "autoscaling:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "SecurityGroupAccess"
                    },
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowGetAuthTokenAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.jenkins_universal will be created
  + resource "aws_iam_role_policy" "jenkins_universal" {
      + id          = (known after apply)
      + name        = "jenkins-universal"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ec2:DescribeTags"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowAnsibleDescribeEc2TagsAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeDhcpOptions",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowVPCAccess"
                    },
                  + {
                      + Action   = "ec2:CreateNetworkInterfacePermission"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ec2:ap-northeast-2:680463082671:network-interface/*"
                      + Sid      = "AllowEC2NetworkAccess"
                    },
                  + {
                      + Action   = [
                          + "ssmmessages:OpenDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:CreateControlChannel",
                          + "ssm:UpdateInstanceInformation",
                          + "ssm:TerminateSession",
                          + "ssm:StartSession",
                          + "ssm:ResumeSession",
                          + "ssm:DescribeSessions",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowSSMAccess"
                    },
                  + {
                      + Action   = [
                          + "elasticfilesystem:DescribeMountTargets",
                          + "elasticfilesystem:DescribeFileSystems",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowEFSAccess"
                    },
                  + {
                      + Action   = "s3:GetEncryptionConfiguration"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowGetEncryptionConfiguration"
                    },
                  + {
                      + Action   = [
                          + "ec2messages:SendReply",
                          + "ec2messages:GetMessages",
                          + "ec2messages:GetEndpoint",
                          + "ec2messages:FailMessage",
                          + "ec2messages:DeleteMessage",
                          + "ec2messages:AcknowledgeMessage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowEC2MessagesPermission"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.jenkins_attach will be created
  + resource "aws_iam_role_policy_attachment" "jenkins_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "app-jenkins"
    }

  # module.sops_seeun_id.aws_iam_role.common will be updated in-place
  ~ resource "aws_iam_role" "common" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = [
                                "arn:aws:iam::680463082671:root",
                              - "AROAZ43WCUSXXZDG32NJI",
                              + "arn:aws:iam::680463082671:role/atlantis-ecs_task_execution",
                            ]
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "seeun-id-sops"
        name                  = "seeun-id-sops"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sops_seeun_id.aws_iam_role.secure will be updated in-place
  ~ resource "aws_iam_role" "secure" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = [
                                "arn:aws:iam::680463082671:root",
                              - "AROAZ43WCUSXXZDG32NJI",
                              + "arn:aws:iam::680463082671:role/atlantis-ecs_task_execution",
                            ]
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "seeun-id-secure-sops"
        name                  = "seeun-id-secure-sops"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 15 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + codebuild_deployment_arn              = (known after apply)
  + codebuild_deployment_instance_profile = (known after apply)
  + jenkins_arn                           = (known after apply)
  + jenkins_instance_profile              = (known after apply)

Error: Invalid backend configuration

  with data.terraform_remote_state.kms,
  on remote_state.tf line 4, in data "terraform_remote_state" "kms":
   4:   config = merge(var.remote_state.kms.seeun-id.apne2, { "assume_role" = { "role_arn" = var.assume_role_arn } })

The given configuration is not valid for backend "s3": unexpected attribute
"assume_role".

```
</details>

